app/views/transactions/requests.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                  %td
                  %td= User.find(tran.requester).name